Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.3.45/edc/ATSAMD10C14A.PIC
      <edc:SFRDef edc:access="-------nnnnnnnnn" edc:addr="0x42000828" edc:cname="DATA" edc:impl="0x1FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0x4200080C" edc:cname="BAUD" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="BAUD" edc:desc="Baud Rate Value" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="-3"/>
            <edc:SFRFieldDef edc:cname="FP" edc:desc="Fractional Part" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4200080E" edc:cname="RXPL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="RXPL" edc:desc="Receive Pulse Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0x42000830" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:desc="Debug Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x42000814" edc:cname="INTENCLR" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x42000816" edc:cname="INTENSET" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x42000818" edc:cname="INTFLAG" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------nnnnnn" edc:addr="0x4200081A" edc:cname="STATUS" edc:impl="0x3F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Parity Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Frame Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:desc="Buffer Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:desc="Clear To Send" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISF" edc:desc="Inconsistent Sync Field" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLL" edc:desc="Collision Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------------rrr" edc:addr="0x4200081C" edc:cname="SYNCBUSY" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SERCOM Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="CTRLB Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:EmulatorSector edc:beginaddr="0xE0001000" edc:endaddr="0xE000F000" edc:regionid="emulation"/>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA05" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="B" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="Y3" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="ULPVREG_BODIIEN" edc:ppsfunction="VREG" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA08" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="ULPVREG_FORCELDO" edc:ppsfunction="VREG" ltx:memberofperipheral="SYSCTRL"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="XIN" ltx:memberofperipheral="SYSCTRL"/>
      <edc:VirtualPin edc:name="XIN32" edc:ppsfunction="XIN32" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA09" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="ULPVREG_REQBIAS" edc:ppsfunction="VREG" ltx:memberofperipheral="SYSCTRL"/>
      <edc:VirtualPin edc:name="XOUT32" edc:ppsfunction="XOUT32" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="X0" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y6" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="G" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XOSC_EN" edc:ppsfunction="XOSC" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="X1" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y7" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="G" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XOSC_CLK" edc:ppsfunction="XOSC" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="RESET_N" edc:ppsfunction="RESET" ltx:memberofperipheral="PM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y14" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="VREG_ENABLE" edc:ppsfunction="VREG" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X9" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA02" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="VOUT" edc:ppsfunction="B" ltx:memberofperipheral="DAC"/>
      <edc:VirtualPin edc:name="Y0" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="CAPLESS_VDDCORE" edc:ppsfunction="VREG" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA04" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="B" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="VREFP" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="Y2" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CAPLESS_EXTREF" edc:ppsfunction="VREG" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
